In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'A': [1, 2, 3, 4],
                   'B': [123, 245, 321, 123],
                   'C': ['aaa', 'bbb', 'ccc', 'ddd']})

In [3]:
df

   A    B    C
0  1  123  aaa
1  2  245  bbb
2  3  321  ccc
3  4  123  ddd

In [4]:
df['B'].unique()

array([123, 245, 321], dtype=int64)

In [5]:
len(df['B'].unique())

3

In [8]:
df['B'].nunique()

3

In [9]:
df['B'].value_counts()

123    2
321    1
245    1
Name: B, dtype: int64

In [10]:
df[df['A'] < 3]

   A    B    C
0  1  123  aaa
1  2  245  bbb

In [11]:
df[(df['A'] < 3) & (df['B'] < 200)]

   A    B    C
0  1  123  aaa

In [12]:
def times3(x):
    return x * 3

In [13]:
df

   A    B    C
0  1  123  aaa
1  2  245  bbb
2  3  321  ccc
3  4  123  ddd

In [14]:
df['A'].sum()

10

In [16]:
df['A'].apply(times3)

0     3
1     6
2     9
3    12
Name: A, dtype: int64

In [17]:
df['A'].apply(times3).sum()

30

In [18]:
df['A'].apply(lambda x: x * 3)

0     3
1     6
2     9
3    12
Name: A, dtype: int64

In [19]:
df['C'].apply(len)

0    3
1    3
2    3
3    3
Name: C, dtype: int64

In [22]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [23]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [24]:
df.sort_values('B')

   A    B    C
0  1  123  aaa
3  4  123  ddd
1  2  245  bbb
2  3  321  ccc

In [25]:
df.isnull()

       A      B      C
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [26]:
df = pd.DataFrame({'A':[1, 1, 1, 2, 2, 2],
                   'B':[123, 222, 222, 123, 123, 222],
                   'C':['aaa', 'bbb', 'aaa', 'bbb', 'bbb', 'aaa'],
                   'D':[1, 2, 4, 3, 1, 5]})

In [27]:
df

   A    B    C  D
0  1  123  aaa  1
1  1  222  bbb  2
2  1  222  aaa  4
3  2  123  bbb  3
4  2  123  bbb  1
5  2  222  aaa  5

In [29]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C      aaa  bbb
A B
1 123  1.0  NaN
  222  4.0  2.0
2 123  NaN  2.0
  222  5.0  NaN